export const f17 = [
  { id: "1", name: "นายจ้าง" },
  { id: "2", name: "ผู้ทำงานส่วนตัว (โดยไม่มีลูกจ้าง)" },
  { id: "3", name: "ผู้ช่วยธุรกิจในครัวเรือน (โดยไม่ได้รับค่าจ้าง)" },
  {
    id: "4",
    name: "ลูกจ้างรัฐบาล",
  },
  {
    id: "5",
    name: "ลูกจ้างรัฐวิสาหกิจ",
  },
  { id: "6", name: "ลูกจ้างเอกชน" },
  { id: "7", name: "สมาชิกของการรวมกลุ่มผู้ผลิต" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f19 = [
  { id: "01", name: "ทำงานบ้าน" },
  { id: "02", name: "เรียนหนังสือ" },
  { id: "03", name: "กำลังหางานทำ" },
  {
    id: "04",
    name: "ยังเด็กหรือชรา",
  },
  {
    id: "05",
    name: "ป่วย พิการ ฯลฯ จนไม่สามารถทำงานได้",
  },
  { id: "06", name: "อยากอยู่เฉย ๆ ไม่ต้องการทำงาน" },
  { id: "07", name: "เกษียณ" },
  { id: "08", name: "สามารถทำงานได้ แต่ไม่มีเงินทุน" },
  { id: "09", name: "ขาดผู้แนะนำด้านอาชีพ" },
  { id: "10", name: "ไม่มีความรู้หรือทักษะในการทำงาน" },
  { id: "11", name: "ญาติพี่น้องให้ความอุปการะ" },
  { id: "12", name: "บุคคลอื่นที่ไม่ใช่ญาติให้ความอุปการะ" },
  { id: "13", name: "มีปัญหาหรือข้อจำกัดในการเดินทาง" },
  { id: "14", name: "มีปัญหาหรือข้อจำกัดในการสื่อสาร" },
  { id: "15", name: "สภาพแวดล้อมไม่เหมาะสมและไม่มีสิ่งอำนวยความสะดวก" },
  { id: "16", name: "ดูแลคนป่วย คนพิการ เด็ก หรือผู้สูงอายุ" },
  { id: "17", name: "ผลกระทบจากสถานการณ์การแพร่ระบาดของโรคโควิด-19" },
  { id: "18", name: "อื่น ๆ (ระบุ)" },
  { id: "99", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];
