export const f20 = [
  { id: "1", name: "ใส่" },
  { id: "2", name: "ไม่ใส่" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f21 = [
  { id: "1", name: "ไม่มีความลำบาก" },
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "มองไม่เห็นเลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f23 = [
  { id: "1", name: "ใช้" },
  { id: "2", name: "ไม่ใช้" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f24 = [
  { id: "1", name: "ไม่มีความลำบาก" },
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "ไม่ได้ยินเลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f26 = [
  { id: "1", name: "ใช่" },
  { id: "2", name: "ไม่ใช่" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f27 = [
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "เดินไม่ได้เลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f28 = [{ id: "1", name: "ไม่มีความลำบาก" }, ...f27];

export const f30 = [
  { id: "1", name: "ไม่มีความลำบาก" },
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "ทำไม่ได้เลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f31 = [
  { id: "1", name: "ไม่มีความลำบาก" },
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "ไม่เข้าใจเลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f34 = [
  { id: "1", name: "ไม่มีความลำบาก" },
  { id: "2", name: "มีความลำบากเล็กน้อย" },
  { id: "3", name: "มีความลำบากมาก" },
  { id: "4", name: "เล่นไม่ได้เลย" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f35 = [
  { id: "1", name: "มี" },
  { id: "2", name: "ไม่มี เนื่องจากครอบครัวคิดว่าไม่มีความจำเป็น" },
  {
    id: "3",
    name: "ไม่มี เนื่องจากครอบครัวกังวลว่าเด็กอาจถูกแกล้ง/มีอุบัติเหตุ",
  },
  { id: "4", name: "ไม่มี เนื่องจากครอบครัวไม่มีเวลาพาไป" },
  { id: "5", name: "ไม่มี เนื่องจากเพื่อนบ้าน/ศูนย์เด็กเล็กไม่ยอมรับ" },
  { id: "6", name: "ไม่มี เนื่องจากเดินทางไปลำบาก/ไม่มีค่าเดินทาง" },
  { id: "7", name: "ไม่มี เนื่องจากไม่มีพื้นที่เล่นสำหรับเด็ก" },
  { id: "8", name: "ไม่มี เนื่องจากเด็กป่วย พิการจนเล่นไม่ได้" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f36 = [
  { id: "1", name: "ไม่เคยทำ" },
  { id: "2", name: "เท่ากันหรือน้อยกว่า" },
  { id: "3", name: "มากกว่า" },
  { id: "4", name: "มากกว่ามาก" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];
