export const f11 = [
  { id: "1", name: "โรงเรียน/สถานศึกษาสำหรับนักเรียนทั่วไป" },
  { id: "2", name: "โรงเรียน/สถานศึกษาชั้นคู่ขนาน" },
  { id: "3", name: "โรงเรียน/สถานศึกษาเฉพาะความพิการสำหรับคนพิการแต่ละประเภท" },
  {
    id: "4",
    name: "โรงเรียน/สถานศึกษาเฉพาะคนพิการที่ให้บริการมากกว่า 1 ประเภท",
  },
  {
    id: "5",
    name: "ศูนย์การศึกษาพิเศษ (เตรียมความพร้อมให้คนพิการก่อนเข้าเรียน)",
  },
  { id: "6", name: "กศน." },
  { id: "7", name: "อื่น ๆ (ระบุ)" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f12 = [
  { id: "01", name: "อายุไม่ถึงเกณฑ์การศึกษา" },
  { id: "02", name: "จบการศึกษาแล้ว" },
  { id: "03", name: "ไม่สนใจหรือคิดว่าไม่มีประโยชน์ที่จะเรียน" },
  {
    id: "04",
    name: "เข้าเรียนต่อไม่ได้",
  },
  {
    id: "05",
    name: "ไม่มีทุนทรัพย์เรียน",
  },
  { id: "06", name: "ต้องหาเลี้ยงตนเองหรือครอบครัว" },
  { id: "07", name: "มีปัญหาทางความประพฤติ" },
  { id: "08", name: "พิการ เรียนได้ แต่ถูกเพื่อนล้อเลียน/แกล้ง" },
  { id: "09", name: "ป่วยหรือพิการจนไม่สามารถเรียนได้" },
  { id: "10", name: "ครอบครัวเป็นห่วง" },
  { id: "11", name: "ไม่มีโรงเรียนพิเศษสำหรับคนพิการ" },
  {
    id: "12",
    name: "โรงเรียนปกติไม่มีบุคลากรที่พร้อมจะสอน/รับคนพิการเข้าเรียน",
  },
  { id: "13", name: "สภาพแวดล้อมในโรงเรียนไม่เอื้อต่อการเรียน" },
  { id: "14", name: "โรงเรียนอยู่ไกลหรือการคมนาคมไม่สะดวก" },
  { id: "15", name: "อื่น ๆ (ระบุ)" },
  { id: "99", name: "ไม่ทราบ" },
  { id: "-1", name: " ไม่เข้าข่าย" },
];

export const f13 = [
  { id: "1", name: "ไม่มี" },
  { id: "2", name: "มี จัดโดยผู้ปกครอง" },
  {
    id: "3",
    name: "มี จัดโดยศูนย์การเรียนรู้ชุมชน/มูลนิธิ/เครือข่ายผู้ปกครอง/ศูนย์บริการคนพิการทั่วไป",
  },
  {
    id: "4",
    name: "อื่น ๆ (ระบุ)",
  },
  {
    id: "9",
    name: "ไม่ทราบ",
  },
  { id: "-1", name: "ไม่เข้าข่าย" },
];
