const useMemberParams = () => {
  const f1 = [];
  for (let i = 1; i <= 98; i++) {
    const trail = String(i).padStart(2, "0");
    f1.push({ id: trail, name: `สมาชิกลำดับที่ ${i}` });
  }

  const f2 = [
    { id: "1", name: "นาย" },
    { id: "2", name: "นาง" },
    { id: "3", name: "นางสาว" },
    { id: "4", name: "เด็กชาย" },
    { id: "5", name: "เด็กหญิง" },
    { id: "6", name: "อื่นๆ (ระบุ)" },
  ];

  const f4 = [
    { id: "01", name: "หัวหน้าครัวเรือน" },
    { id: "02", name: "ภรรยาหรือสามี" },
    { id: "03", name: "บุตรที่ยังไม่สมรส" },
    { id: "04", name: "บุตรที่สมรสแล้ว" },
    { id: "05", name: "บุตรเขย/บุตรสะใภ้" },
    { id: "06", name: "บุตรของบุตร" },
    { id: "07", name: "พ่อแม่" },
    { id: "08", name: "พ่อแม่ของคู่สมรส" },
    { id: "09", name: "ปู่ ย่า ตา ยาย" },
    { id: "10", name: "ลุง ป้า น้า อา" },
    { id: "11", name: "พี่ น้อง" },
    { id: "12", name: "ญาติอื่น ๆ" },
    { id: "13", name: "ผู้อาศัย" },
    { id: "14", name: "คนรับใช้/ลูกจ้างในครัวเรือน" },
    { id: "15", name: "ลูกจ้างในธุรกิจของครัวเรือน" },
  ];

  const f5 = [
    { id: "1", name: "ชาย" },
    { id: "2", name: "หญิง" },
  ];

  const f6 = [];
  f6.push({ id: "000", name: "อายุต่ำกว่า 1 ปี" });
  for (let i = 1; i <= 150; i++) {
    const trail = String(i).padStart(3, "0");
    f6.push({ id: trail, name: `อายุ ${i} ปี` });
  }

  const f7 = [
    { id: "01", name: "ไทย" },
    { id: "02", name: "พม่า" },
    { id: "03", name: "กัมพูชา" },
    { id: "04", name: "ลาว" },
    { id: "05", name: "มาเลเซีย" },
    { id: "06", name: "จีน" },
    { id: "07", name: "ญี่ปุ่น" },
    { id: "08", name: "อินเดีย" },
    { id: "09", name: "อังกฤษ" },
    { id: "10", name: "สหรัฐอเมริกา" },
    { id: "11", name: "สัญชาติอื่น ๆ (ระบุ)" },
    { id: "12", name: "ไม่มีสัญชาติ" },
  ];

  const f8 = [
    { id: "1", name: "ไม่ได้รับสวัสดิการค่ารักษาพยาบาล" },
    { id: "2", name: "บัตรประกันสุขภาพ (บัตรทอง): ทั่วไป" },
    { id: "3", name: "บัตรประกันสุขภาพ (บัตรทอง): คนพิการ (ท.74)" },
    { id: "4", name: "บัตรประกันสุขภาพ (บัตรทอง): ไม่ทราบประเภท" },
    { id: "5", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ทั่วไป" },
    { id: "6", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ทุพพลภาพ" },
    { id: "7", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ไม่ทราบประเภท" },
    { id: "8", name: "สวัสดิการข้าราชการ/ข้าราชการบำนาญ/รัฐวิสาหกิจ" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f9 = [
    { id: "1", name: "โสด" },
    { id: "2", name: "สมรส หรืออยู่กินฉันสามีภรรยา" },
    { id: "3", name: "หม้าย" },
    { id: "4", name: "หย่า" },
    { id: "5", name: "แยกกันอยู่" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f11 = [
    { id: "1", name: "โรงเรียน/สถานศึกษาสำหรับนักเรียนทั่วไป" },
    { id: "2", name: "โรงเรียน/สถานศึกษาชั้นคู่ขนาน" },
    {
      id: "3",
      name: "โรงเรียน/สถานศึกษาเฉพาะความพิการสำหรับคนพิการแต่ละประเภท",
    },
    {
      id: "4",
      name: "โรงเรียน/สถานศึกษาเฉพาะคนพิการที่ให้บริการมากกว่า 1 ประเภท",
    },
    {
      id: "5",
      name: "ศูนย์การศึกษาพิเศษ (เตรียมความพร้อมให้คนพิการก่อนเข้าเรียน)",
    },
    { id: "6", name: "กศน." },
    { id: "7", name: "อื่น ๆ (ระบุ)" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f12 = [
    { id: "01", name: "อายุไม่ถึงเกณฑ์การศึกษา" },
    { id: "02", name: "จบการศึกษาแล้ว" },
    { id: "03", name: "ไม่สนใจหรือคิดว่าไม่มีประโยชน์ที่จะเรียน" },
    {
      id: "04",
      name: "เข้าเรียนต่อไม่ได้",
    },
    {
      id: "05",
      name: "ไม่มีทุนทรัพย์เรียน",
    },
    { id: "06", name: "ต้องหาเลี้ยงตนเองหรือครอบครัว" },
    { id: "07", name: "มีปัญหาทางความประพฤติ" },
    { id: "08", name: "พิการ เรียนได้ แต่ถูกเพื่อนล้อเลียน/แกล้ง" },
    { id: "09", name: "ป่วยหรือพิการจนไม่สามารถเรียนได้" },
    { id: "10", name: "ครอบครัวเป็นห่วง" },
    { id: "11", name: "ไม่มีโรงเรียนพิเศษสำหรับคนพิการ" },
    {
      id: "12",
      name: "โรงเรียนปกติไม่มีบุคลากรที่พร้อมจะสอน/รับคนพิการเข้าเรียน",
    },
    { id: "13", name: "สภาพแวดล้อมในโรงเรียนไม่เอื้อต่อการเรียน" },
    { id: "14", name: "โรงเรียนอยู่ไกลหรือการคมนาคมไม่สะดวก" },
    { id: "15", name: "อื่น ๆ (ระบุ)" },
    { id: "99", name: "ไม่ทราบ" },
    { id: "-1", name: " ไม่เข้าข่าย" },
  ];

  const f13 = [
    { id: "1", name: "ไม่มี" },
    { id: "2", name: "มี จัดโดยผู้ปกครอง" },
    {
      id: "3",
      name: "มี จัดโดยศูนย์การเรียนรู้ชุมชน/มูลนิธิ/เครือข่ายผู้ปกครอง/ศูนย์บริการคนพิการทั่วไป",
    },
    {
      id: "4",
      name: "อื่น ๆ (ระบุ)",
    },
    {
      id: "9",
      name: "ไม่ทราบ",
    },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f17 = [
    { id: "1", name: "นายจ้าง" },
    { id: "2", name: "ผู้ทำงานส่วนตัว (โดยไม่มีลูกจ้าง)" },
    { id: "3", name: "ผู้ช่วยธุรกิจในครัวเรือน (โดยไม่ได้รับค่าจ้าง)" },
    {
      id: "4",
      name: "ลูกจ้างรัฐบาล",
    },
    {
      id: "5",
      name: "ลูกจ้างรัฐวิสาหกิจ",
    },
    { id: "6", name: "ลูกจ้างเอกชน" },
    { id: "7", name: "สมาชิกของการรวมกลุ่มผู้ผลิต" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f19 = [
    { id: "01", name: "ทำงานบ้าน" },
    { id: "02", name: "เรียนหนังสือ" },
    { id: "03", name: "กำลังหางานทำ" },
    {
      id: "04",
      name: "ยังเด็กหรือชรา",
    },
    {
      id: "05",
      name: "ป่วย พิการ ฯลฯ จนไม่สามารถทำงานได้",
    },
    { id: "06", name: "อยากอยู่เฉย ๆ ไม่ต้องการทำงาน" },
    { id: "07", name: "เกษียณ" },
    { id: "08", name: "สามารถทำงานได้ แต่ไม่มีเงินทุน" },
    { id: "09", name: "ขาดผู้แนะนำด้านอาชีพ" },
    { id: "10", name: "ไม่มีความรู้หรือทักษะในการทำงาน" },
    { id: "11", name: "ญาติพี่น้องให้ความอุปการะ" },
    { id: "12", name: "บุคคลอื่นที่ไม่ใช่ญาติให้ความอุปการะ" },
    { id: "13", name: "มีปัญหาหรือข้อจำกัดในการเดินทาง" },
    { id: "14", name: "มีปัญหาหรือข้อจำกัดในการสื่อสาร" },
    { id: "15", name: "สภาพแวดล้อมไม่เหมาะสมและไม่มีสิ่งอำนวยความสะดวก" },
    { id: "16", name: "ดูแลคนป่วย คนพิการ เด็ก หรือผู้สูงอายุ" },
    { id: "17", name: "ผลกระทบจากสถานการณ์การแพร่ระบาดของโรคโควิด-19" },
    { id: "18", name: "อื่น ๆ (ระบุ)" },
    { id: "99", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f20 = [
    { id: "1", name: "ใส่" },
    { id: "2", name: "ไม่ใส่" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f21 = [
    { id: "1", name: "ไม่มีความลำบาก" },
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "มองไม่เห็นเลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f23 = [
    { id: "1", name: "ใช้" },
    { id: "2", name: "ไม่ใช้" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f24 = [
    { id: "1", name: "ไม่มีความลำบาก" },
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "ไม่ได้ยินเลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f26 = [
    { id: "1", name: "ใช่" },
    { id: "2", name: "ไม่ใช่" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f27 = [
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "เดินไม่ได้เลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f28 = [{ id: "1", name: "ไม่มีความลำบาก" }, ...f27];

  const f30 = [
    { id: "1", name: "ไม่มีความลำบาก" },
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "ทำไม่ได้เลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f31 = [
    { id: "1", name: "ไม่มีความลำบาก" },
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "ไม่เข้าใจเลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f34 = [
    { id: "1", name: "ไม่มีความลำบาก" },
    { id: "2", name: "มีความลำบากเล็กน้อย" },
    { id: "3", name: "มีความลำบากมาก" },
    { id: "4", name: "เล่นไม่ได้เลย" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f35 = [
    { id: "1", name: "มี" },
    { id: "2", name: "ไม่มี เนื่องจากครอบครัวคิดว่าไม่มีความจำเป็น" },
    {
      id: "3",
      name: "ไม่มี เนื่องจากครอบครัวกังวลว่าเด็กอาจถูกแกล้ง/มีอุบัติเหตุ",
    },
    { id: "4", name: "ไม่มี เนื่องจากครอบครัวไม่มีเวลาพาไป" },
    { id: "5", name: "ไม่มี เนื่องจากเพื่อนบ้าน/ศูนย์เด็กเล็กไม่ยอมรับ" },
    { id: "6", name: "ไม่มี เนื่องจากเดินทางไปลำบาก/ไม่มีค่าเดินทาง" },
    { id: "7", name: "ไม่มี เนื่องจากไม่มีพื้นที่เล่นสำหรับเด็ก" },
    { id: "8", name: "ไม่มี เนื่องจากเด็กป่วย พิการจนเล่นไม่ได้" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  const f36 = [
    { id: "1", name: "ไม่เคยทำ" },
    { id: "2", name: "เท่ากันหรือน้อยกว่า" },
    { id: "3", name: "มากกว่า" },
    { id: "4", name: "มากกว่ามาก" },
    { id: "9", name: "ไม่ทราบ" },
    { id: "-1", name: "ไม่เข้าข่าย" },
  ];

  return {
    f1,
    f2,
    f4,
    f5,
    f6,
    f7,
    f8,
    f9,
    f11,
    f12,
    f13,
    f17,
    f19,
    f20,
    f21,
    f23,
    f24,
    f26,
    f27,
    f28,
    f30,
    f31,
    f34,
    f35,
    f36,
  };
};

export default useMemberParams;
