const f1 = [];
for (let i = 1; i <= 98; i++) {
  const trail = String(i).padStart(2, "0");
  f1.push({ id: trail, name: `สมาชิกลำดับที่ ${i}` });
}
export { f1 };

export const f2 = [
  { id: "1", name: "นาย" },
  { id: "2", name: "นาง" },
  { id: "3", name: "นางสาว" },
  { id: "4", name: "เด็กชาย" },
  { id: "5", name: "เด็กหญิง" },
  { id: "6", name: "อื่นๆ (ระบุ)" },
];

export const f4 = [
  { id: "01", name: "หัวหน้าครัวเรือน" },
  { id: "02", name: "ภรรยาหรือสามี" },
  { id: "03", name: "บุตรที่ยังไม่สมรส" },
  { id: "04", name: "บุตรที่สมรสแล้ว" },
  { id: "05", name: "บุตรเขย/บุตรสะใภ้" },
  { id: "06", name: "บุตรของบุตร" },
  { id: "07", name: "พ่อแม่" },
  { id: "08", name: "พ่อแม่ของคู่สมรส" },
  { id: "09", name: "ปู่ ย่า ตา ยาย" },
  { id: "10", name: "ลุง ป้า น้า อา" },
  { id: "11", name: "พี่ น้อง" },
  { id: "12", name: "ญาติอื่น ๆ" },
  { id: "13", name: "ผู้อาศัย" },
  { id: "14", name: "คนรับใช้/ลูกจ้างในครัวเรือน" },
  { id: "15", name: "ลูกจ้างในธุรกิจของครัวเรือน" },
];

export const f5 = [
  { id: "1", name: "ชาย" },
  { id: "2", name: "หญิง" },
];

const f6 = [];
f6.push({ id: "000", name: "อายุต่ำกว่า 1 ปี" });
for (let i = 1; i <= 150; i++) {
  const trail = String(i).padStart(3, "0");
  f6.push({ id: trail, name: `อายุ ${i} ปี` });
}
export { f6 };

export const f7 = [
  { id: "01", name: "ไทย" },
  { id: "02", name: "พม่า" },
  { id: "03", name: "กัมพูชา" },
  { id: "04", name: "ลาว" },
  { id: "05", name: "มาเลเซีย" },
  { id: "06", name: "จีน" },
  { id: "07", name: "ญี่ปุ่น" },
  { id: "08", name: "อินเดีย" },
  { id: "09", name: "อังกฤษ" },
  { id: "10", name: "สหรัฐอเมริกา" },
  { id: "11", name: "สัญชาติอื่น ๆ (ระบุ)" },
  { id: "12", name: "ไม่มีสัญชาติ" },
];

export const f8 = [
  { id: "1", name: "ไม่ได้รับสวัสดิการค่ารักษาพยาบาล" },
  { id: "2", name: "บัตรประกันสุขภาพ (บัตรทอง): ทั่วไป" },
  { id: "3", name: "บัตรประกันสุขภาพ (บัตรทอง): คนพิการ (ท.74)" },
  { id: "4", name: "บัตรประกันสุขภาพ (บัตรทอง): ไม่ทราบประเภท" },
  { id: "5", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ทั่วไป" },
  { id: "6", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ทุพพลภาพ" },
  { id: "7", name: "บัตรประกันสังคม/กองทุนเงินทดแทน: ไม่ทราบประเภท" },
  { id: "8", name: "สวัสดิการข้าราชการ/ข้าราชการบำนาญ/รัฐวิสาหกิจ" },
  { id: "9", name: "ไม่ทราบ" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];

export const f9 = [
  { id: "1", name: "โสด" },
  { id: "2", name: "สมรส หรืออยู่กินฉันสามีภรรยา" },
  { id: "3", name: "หม้าย" },
  { id: "4", name: "หย่า" },
  { id: "5", name: "แยกกันอยู่" },
  { id: "-1", name: "ไม่เข้าข่าย" },
];
